In [1]:
url = 'https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv'

In [11]:
import pandas as pd

In [12]:
df = pd.read_csv(url)
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [13]:
df.drop(['PassengerId','Name','Ticket','Cabin','Embarked','SibSp','Parch'], axis='columns', inplace=True)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [14]:
#seperating dataframe to inputs and target

target = df.Survived
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [16]:
input = df.drop(['Survived'], axis='columns')
input

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [18]:
#converting sex to numbers 

dummies= pd.get_dummies(input.Sex)

dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [20]:
input = pd.concat([input,dummies], axis='columns')
input = input.drop(['Sex'], axis='columns')
input.head()

   Pclass   Age     Fare  female  male  female  male
0       3  22.0   7.2500       0     1       0     1
1       1  38.0  71.2833       1     0       1     0
2       3  26.0   7.9250       1     0       1     0
3       1  35.0  53.1000       1     0       1     0
4       3  35.0   8.0500       0     1       0     1

In [21]:
#checking if there are any null values 

input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [22]:
#we can see that age has a null value

In [23]:
input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [25]:
#filling the na values with the mean 

input.Age = input.Age.fillna(input.Age.mean())
input.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [34]:
#trainign model
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(input,target,test_size=0.3)


from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [35]:
model.fit(x_train, y_train)

GaussianNB()

In [36]:
model.score(x_test, y_test)

0.7276119402985075

In [37]:
model.predict(x_test[:10])

array([1, 0, 1, 1, 0, 1, 1, 1, 0, 0], dtype=int64)

In [38]:
#predicting the probability 

model.predict_proba(x_test[:10])

array([[1.78207049e-04, 9.99821793e-01],
       [9.97538249e-01, 2.46175064e-03],
       [2.05676330e-04, 9.99794324e-01],
       [4.36257328e-05, 9.99956374e-01],
       [9.99459771e-01, 5.40228780e-04],
       [5.07967708e-06, 9.99994920e-01],
       [2.22792736e-04, 9.99777207e-01],
       [2.22554525e-04, 9.99777445e-01],
       [9.99775321e-01, 2.24679483e-04],
       [9.99782603e-01, 2.17396865e-04]])